Revit 2027 API
MechanicalEquipmentSet.Classification Property
 The classification for the mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EquipmentClassification Classification { get; }
Public ReadOnly Property Classification As EquipmentClassification
	Get
public:
property EquipmentClassification Classification {
	EquipmentClassification get ();
}
member Classification : EquipmentClassification with get
Property Value
EquipmentClassification
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace